<script setup>
useHead({
  title: "Капітан | Організація | Мавка",
});

definePageMeta({
  layout: "org",
});
</script>

<template>
  <UiDocsWrapper prev="/організація" next="/організація/кернел">
    <h1 class="docs-content-title">Капітан</h1>

    <p>Капітан є учасником ОМ.</p>
    <p>Капітан є менеджером ОМ.</p>
    <p>Капітан звітує перед учасниками ОМ та автором.</p>
    <p>Капітан обирається учасниками ОМ шляхом голосування.</p>
    <hr />
    <p>Детальніше про структуру ОМ можна дізнатись ставши учасником ОМ.</p>
  </UiDocsWrapper>
</template>
