<script setup>
useHead({
  title: "Кернел | Організація | Мавка",
});

definePageMeta({
  layout: "org",
});
</script>

<template>
  <UiDocsWrapper prev="/організація/капітан" next="/організація/учасник">
    <h1 class="docs-content-title">Кернел</h1>

    <p>Кернел є учасником ОМ.</p>
    <p>Кернел є менеджером проектів ОМ.</p>
    <p>Кернел звітує перед учасниками ОМ та автором.</p>
    <p>Кернел обирається учасниками ОМ шляхом голосування.</p>
    <hr />
    <p>Детальніше про структуру ОМ можна дізнатись ставши учасником ОМ.</p>
  </UiDocsWrapper>
</template>
