<script setup>
const a = `
макет модуль М
  Е число
  ЛОГ10 число
  ЛОГ2 число
  ЛОГ2Е число
  ЛОГ10Е число
  ПІ число
  КОРІНЬ1_2 число
  КОРІНЬ2 число

  абс(значення число) число
  арккос(значення число) число
  арксин(значення число) число
  арктан(значення число) число
  арктан2(значення число) число
  до_більшого(значення число) число
  кос(значення число) число
  експ(значення число) число
  до_меншого(значення число) число
  найбільше(...значення) число
  найменше(...значення) число
  степінь(а число, б число) число
  округлити(значення число) число
  син(значення число) число
  корінь(значення число) число
  тан(значення число) число
кінець
`.trim();

const example = `
взяти "М"

друк(М.абс(-10))
друк(М.ПІ)
друк(М.корінь(9))
друк(М.степінь(2, 3))
друк(М.округлити(3.14))
друк(М.найбільше(1, 2, 3, 4, 5))
друк(М.найменше(1, 2, 3, 4, 5))
`.trim();

useHead({
  title: "Математика | Бібліотека | Документація | Мавка",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/бог" next="/документація/дід">
    <h1 class="docs-content-title">Математика</h1>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs language="diia" :autodetect="false" :code="a"/>
      </ClientOnly>
    </div>
    <hr>
    <h3>Приклад використання</h3>
    <UiCodeBlock :files="example"/>
    <hr>
    <blockquote>
      Щось ще може змінитись до версії 1.0.0. Прохання мати це наувазі.
    </blockquote>
  </UiDocsWrapper>
</template>
