<script setup>
const a = `
модуль М
  Е число
  ЛОГ10 число
  ЛОГ2 число
  ЛОГ2Е число
  ЛОГ10Е число
  ПІ число
  КОРІНЬ1_2 число
  КОРІНЬ2 число

  дія абс(значення число) число
  дія арккос(значення число) число
  дія арксин(значення число) число
  дія арктан(значення число) число
  дія арктан2(значення число) число
  дія до_більшого(значення число) число
  дія кос(значення число) число
  дія експ(значення число) число
  дія до_меншого(значення число) число
  дія найбільше(значення список<число>) число
  дія найменше(значення список<число>) число
  дія степінь(а число, б число) число
  дія округлити(значення число) число
  дія син(значення число) число
  дія корінь(значення число) число
  дія тан(значення число) число
кінець
`.trim();

const example = `
взяти біб М

друк(М.абс(-10))
друк(М.ПІ)
друк(М.корінь(9))
друк(М.степінь(2, 3))
друк(М.округлити(3.14))
друк(М.найбільше([1, 2, 3, 4, 5]))
друк(М.найменше([1, 2, 3, 4, 5]))
`.trim();

useHead({
  title: "Математика | Бібліотека | Документація | Мавка",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/бібліотека" next="/документація/дід">
    <h1 class="docs-content-title">Математика</h1>
    <p>
      Математика
      <span style="font-weight: 500" class="hljs-keyword">це</span> вбудований
      модуль, що дає деякі математичні константи та функції.
    </p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs language="diia" :autodetect="false" :code="a" />
      </ClientOnly>
    </div>
    <hr />
    <h3>Приклад використання</h3>
    <UiCodeBlock :files="example" />
  </UiDocsWrapper>
</template>
