<script setup>
const a = `
макет модуль М
  макет субʼєкт Е число
  макет субʼєкт ЛОГ10 число
  макет субʼєкт ЛОГ2 число
  макет субʼєкт ЛОГ2Е число
  макет субʼєкт ЛОГ10Е число
  макет субʼєкт ПІ число
  макет субʼєкт КОРІНЬ1_2 число
  макет субʼєкт КОРІНЬ2 число

  макет дія абс(значення число) число
  макет дія арккос(значення число) число
  макет дія арксин(значення число) число
  макет дія арктан(значення число) число
  макет дія арктан2(значення число) число
  макет дія до_більшого(значення число) число
  макет дія кос(значення число) число
  макет дія експ(значення число) число
  макет дія до_меншого(значення число) число
  макет дія найбільше(значення список<число>) число
  макет дія найменше(значення список<число>) число
  макет дія степінь(а число, б число) число
  макет дія округлити(значення число) число
  макет дія син(значення число) число
  макет дія корінь(значення число) число
  макет дія тан(значення число) число
кінець
`.trim();

const example = `
взяти М

друк(М.абс(-10))
друк(М.ПІ)
друк(М.корінь(9))
друк(М.степінь(2, 3))
друк(М.округлити(3.14))
друк(М.найбільше([1, 2, 3, 4, 5]))
друк(М.найменше([1, 2, 3, 4, 5]))
`.trim();

useHead({
  title: "Математика | Бібліотека | Документація | Мавка"
});

definePageMeta({
  layout: "docs"
});
</script>

<template>
  <UiDocsWrapper prev="/документація/бібліотека" next="/документація/дід">
    <h1 class="docs-content-title">Математика</h1>
    <p>
      Математика <span style="font-weight: 500" class="hljs-keyword">це</span> вбудований модуль, що дає деякі
      математичні
      константи та функції.
    </p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs language="diia" :autodetect="false" :code="a" />
      </ClientOnly>
    </div>
    <hr>
    <h3>Приклад використання</h3>
    <UiCodeBlock :files="example" />
  </UiDocsWrapper>
</template>
