<script setup>
const serverModuleMockup = `
макет модуль сервер
  макет структура Опції
    хост текст = "localhost"
    порт число = 80
  кінець

  макет структура Сервер
    обробник Дія
    опції Опції
  кінець
  макет дія Сервер.запустити(зворот Дія або пусто = пусто)

  макет структура Запит
    метод текст
    шлях текст
    заголовки словник
    дані байти
  кінець

  макет структура Відповідь
    код число = 200
    заголовки словник = ()
    дані байти або текст = ""
  кінець

  макет дія запустити(
    обробник Дія,
    опції Опції = (),
    зворот Дія або пусто = пусто
  ) Сервер
кінець
`.trim();

const example = `
взяти сервер

сервер.запустити(
  дія(запит сервер.Запит)
    якщо запит.шлях == "/"
      вернути "Привіт!"
    кінець

    вернути сервер.Відповідь(404)
  кінець,
  сервер.Опції(порт=8080),
  (): друк("Сервер запущено на http://localhsot:8080.")
)
`.trim();

useHead({
  title: "Сервер | Бібліотека | Документація | Мавка"
});

definePageMeta({
  layout: "docs"
});
</script>

<template>
  <UiDocsWrapper prev="/документація/математика" next="/документація/запит">
    <h1 class="docs-content-title">Сервер</h1>
    <p>
      Сервер <span style="font-weight: 500" class="hljs-keyword">це</span> вбудований пак, що дозволяє зручно <span
      style="font-weight: 500" class="hljs-keyword">та</span> просто
      обробляти HTTP-запити.
    </p>
    <hr />
    <h3>Приклад</h3>
    <UiCodeBlock :files="example" />
    <hr>
    <UiCodeBlock :files="serverModuleMockup" />
  </UiDocsWrapper>
</template>
