<script setup>
const text = `
"Привіт від Лесі!"
`.trim();

const text2 = `
"Стій, серце, стій! не бийся так шалено."
`.trim();

const text3 = `
"""Чи довго ще, о господи, чи довго
ми будемо блукати і шукати
рідного краю на своїй землі?
Який ми гріх вчинили проти духа,
що він зламав свій заповіт великий,
той, взятий з бою волі заповіт?
Так доверши ж до краю тую зраду,
розбий, розсій нас геть по цілім світі,
тоді, либонь, журба по ріднім краю
навчить нас, де і як його шукать."""
`.trim();

const textStructure = `
структура текст
  довжина число

  символ(позиція число) текст
  код_символу(позиція число) текст
  позиція(значення текст) число
  повторити(кількість число) текст
  замінити(старе_значення текст, нове_значення текст) текст
  замінити_перше(старе_значення текст, нове_значення текст) текст
  зрізати(від число, до число або пусто = пусто) текст
  приєднати(...значення) текст
  розділити(роздільник текст) текст
  починається_з(значення текст) логічне
  закінчується_на(значення текст) логічне
  обрізати() текст
кінець
`.trim();

useHead({
  title: "Текст | Документація | Мавка",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/число" next="/документація/логічне">
    <h1 class="docs-content-title">Текст</h1>

    <p>
      Текст
      <span style="font-weight: 500" class="hljs-keyword">є</span> елементарним
      обʼєктом <span class="diia-word">Мавки</span>.
    </p>
    <p>
      Текст описано спеціальною
      <span style="font-weight: 500" class="hljs-keyword">структурою </span>
      <code>текст</code>.
    </p>
    <hr />
    <h3>Створення тексту</h3>
    <p>
      Текст записується між символами подвійних лапок або трьома символами
      подвійних лапок.
    </p>
    <UiCodeBlock :files="text2" />
    <br />
    <UiCodeBlock :files="text3" />
    <hr />
    <h3>Структура тексту</h3>
    <UiCodeBlock :files="textStructure" />
  </UiDocsWrapper>
</template>
