<script setup>
const example = `
взяти фс

чекати фс.записати("./привіт.txt", "Привіт!")

чекати привіт = фс.прочитати("./привіт.txt", "текст")

друк(привіт)
`.trim();

const fsModuleMockup = `
макет модуль фс
  тривала дія прочитати(шлях текст) байти
  тривала дія прочитати_текст(шлях текст, кодування текст = "utf8") текст
  тривала дія записати(шлях текст, дані байти або текст) ніщо
  тривала дія дописати(шлях текст, дані байти або текст) ніщо
  тривала дія перейменувати(шлях текст, новий_шлях текст) ніщо
  тривала дія створити_папку(шлях текст) ніщо
  тривала дія створити_папку_рекурсивно(шлях текст) ніщо
  тривала дія видалити(шлях текст) ніщо
  тривала дія видалити_папку(шлях текст) ніщо
  тривала дія видалити_папку_рекурсивно(шлях текст) ніщо
  тривала дія існує(шлях текст) логічне
кінець
`.trim();

useHead({
  title: "Файлова система | Бібліотека | Документація | Мавка"
});

definePageMeta({
  layout: "docs"
});
</script>

<template>
  <UiDocsWrapper prev="/документація/запит" next="/документація/json">
    <h1 class="docs-content-title">Файлова система</h1>
    <p>
      Файлова система <span style="font-weight: 500" class="hljs-keyword">це</span> вбудований модуль, що дозволяє зручно
      <span
        style="font-weight: 500" class="hljs-keyword">та</span> просто
      працювати з файлами на вашому компʼютері.
    </p>
    <hr />
    <h3>Приклад</h3>
    <UiCodeBlock :files="example" />
    <hr>
    <UiCodeBlock :files="fsModuleMockup" />
  </UiDocsWrapper>
</template>
