<script setup>
const simple1 = `
чародія_виклик(...) щось ;; перезаписує оператор виклику ()

чародія_додавання(значення щось) щось ;; перезаписує оператор +
чародія_віднімання(значення щось) щось ;; перезаписує оператор -
чародія_множення(значення щось) щось ;; перезаписує оператор -
чародія_ділення(значення щось) щось ;; перезаписує оператор /

чародія_ділення_за_модулем_остача(значення щось) щось ;; перезаписує оператор %
чародія_ділення_за_модулем_частка(значення щось) щось ;; перезаписує оператор //

чародія_піднесення_до_степеня(значення щось) щось ;; перезаписує оператор **

чародія_зсув_вліво(значення щось) щось ;; перезаписує оператор <<
чародія_зсув_вправо(значення щось) щось ;; перезаписує оператор >>
чародія_побітове_і(значення щось) щось ;; перезаписує оператор &
чародія_побітове_або(значення щось) щось ;; перезаписує оператор |
чародія_побітове_не() ;; перезаписує оператор ~
чародія_побітове_вабо(значення щось) щось ;; перезаписує оператор ^

чародія_порівняння_чи_рівно(значення щось) щось ;; перезаписує оператори == та "рівно"
чародія_порівняння_чи_менше(значення щось) щось ;; перезаписує оператори < та "менше"
чародія_порівняння_чи_не_менше(значення щось) щось ;; перезаписує оператори >= та "не менше"
чародія_порівняння_чи_більше(значення щось) щось ;; перезаписує оператори > та "більше"
чародія_порівняння_чи_не_більше(значення щось) щось ;; перезаписує оператори <= та "не більше"

чародія_отримання_властивості(назва текст) щось ;; викликається на отримання властивості, якої не існує
чародія_присвоєння_властивості(назва текст, значення щось) ніщо ;; викликається на присвоєння властивості

чародія_перетворення_на_текст() текст ;; викликається для перетворення на текст
чародія_перетворення_на_число() число ;; викликається для перетворення на число
чародія_перетворення_на_логічне() логічне ;; викликається для перетворення на логічне

чародія_створення(...) ніщо ;; викликається для створення обʼєкта зі структури (можливо буде видалена)
чародія_після_створення() ніщо ;; викликається після створення обʼєкта зі структури
`.trim();

const simple2 = `
структура МіфічнаІстота
  назва текст
кінець

дія МіфічнаІстота.виконати_виклик()
  друк("%(я.назва) вже на шляху до вас...")
кінець

лісовик = МіфічнаІстота("Лісовик")

лісовик()
`.trim();

useHead({
  title: "Чародія | Документація | Мавка",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/коментар" next="/документація/пак">
    <h1 class="docs-content-title">Чародія</h1>
    <p>
      <span class="diia-word">Мавка</span> надає можливість перезаписувати
      логіку деяких вказівок для обʼєктів через
      <span style="font-weight: 500" class="hljs-keyword">дії</span>. Ці
      <span style="font-weight: 500" class="hljs-keyword">дії</span>
      називаються чародіями.
    </p>
    <hr />
    <h3>Список чародій</h3>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs lang="diia" :autodetect="false" :code="simple1" />
      </ClientOnly>
    </div>
    <hr />
    <h3>Приклад</h3>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs lang="diia" :autodetect="false" :code="simple2" />
      </ClientOnly>
    </div>
    <hr />
    <blockquote>
      Щось ще може змінитись до версії 1.0.0. Прохання мати це наувазі.
    </blockquote>
  </UiDocsWrapper>
</template>
