<script setup>
const simple1 = `
чародія_викликати(...) щось ;; перезаписує вказівку виконання дії ()

чародія_додати(значення щось) щось ;; перезаписує вказівку +
чародія_відняти(значення щось) щось ;; перезаписує вказівку -
чародія_помножити(значення щось) щось ;; перезаписує вказівку *
чародія_поділити(значення щось) щось ;; перезаписує вказівку /

чародія_остача(значення щось) щось ;; перезаписує вказівку %
чародія_частка(значення щось) щось ;; перезаписує вказівку //

чародія_степінь(значення щось) щось ;; перезаписує вказівку **

чародія_вліво(значення щось) щось ;; перезаписує вказівку <<
чародія_вправо(значення щось) щось ;; перезаписує вказівку >>
чародія_ді(значення щось) щось ;; перезаписує вказівку &
чародія_дабо(значення щось) щось ;; перезаписує вказівку |
чародія_дне() ;; перезаписує вказівку ~
чародія_вабо(значення щось) щось ;; перезаписує вказівку ^

чародія_рівно(значення щось) щось ;; перезаписує вказівки == та "рівно"
чародія_менше(значення щось) щось ;; перезаписує вказівки < та "менше"
чародія_не_менше(значення щось) щось ;; перезаписує вказівки >= та "не менше"
чародія_більше(значення щось) щось ;; перезаписує вказівки > та "більше"
чародія_не_більше(значення щось) щось ;; перезаписує вказівки <= та "не більше"

чародія_отримати(назва текст) щось ;; виконується на отримання спеціальної властивості (а[б])
чародія_покласти(назва текст, значення щось) ніщо ;; виконується на зміну спеціальної властивості (а[б] = в)

чародія_текст() текст ;; виконується для перетворення на текст
чародія_число() число ;; виконується для перетворення на число
чародія_логічне() логічне ;; виконується для перетворення на логічне

чародія_створити(...) ніщо ;; перезаписує створення обʼєкта
чародія_після_створення() ніщо ;; виконується після створення обʼєкта
`.trim();

const simple2 = `
структура МіфічнаІстота
  назва текст
кінець

дія МіфічнаІстота.чародія_викликати()
  друк("%(я.назва) вже на шляху до вас...")
кінець

лісовик = МіфічнаІстота("Лісовик")

лісовик()
`.trim();

useHead({
  title: "Чародія | Документація | Мавка"
});

definePageMeta({
  layout: "docs"
});
</script>

<template>
  <UiDocsWrapper prev="/документація/коментар" next="/документація/пак">
    <h1 class="docs-content-title">Чародія</h1>
    <p>
      <span class="diia-word">Мавка</span> надає можливість перезаписувати
      логіку деяких вказівок для обʼєктів через
      <span style="font-weight: 500" class="hljs-keyword">дії</span>. Ці
      <span style="font-weight: 500" class="hljs-keyword">дії</span>
      називаються чародіями.
    </p>
    <hr />
    <h3>Список чародій</h3>
    <UiCodeBlock :files="simple1" />
    <hr />
    <h3>Приклад</h3>
    <UiCodeBlock :files="simple2" />
    <hr />
    <blockquote>
      Щось ще може змінитись до версії 1.0.0. Прохання мати це наувазі.
    </blockquote>
  </UiDocsWrapper>
</template>
