<script setup>
const simple1 = `
чародія_викликати(...) щось ;; перезаписує оператор виконання дії ()

чародія_додати(значення щось) щось ;; перезаписує оператор +
чародія_відняти(значення щось) щось ;; перезаписує оператор -
чародія_помножити(значення щось) щось ;; перезаписує оператор *
чародія_поділити(значення щось) щось ;; перезаписує оператор /

чародія_поділити_за_модулем_остача(значення щось) щось ;; перезаписує оператор %
чародія_поділити_за_модулем_частка(значення щось) щось ;; перезаписує оператор //

чародія_піднести_до_степеня(значення щось) щось ;; перезаписує оператор **

чародія_зсунути_вліво(значення щось) щось ;; перезаписує оператор <<
чародія_зсунути_вправо(значення щось) щось ;; перезаписує оператор >>
чародія_побітове_і(значення щось) щось ;; перезаписує оператор &
чародія_побітове_або(значення щось) щось ;; перезаписує оператор |
чародія_побітове_не() ;; перезаписує оператор ~
чародія_побітове_виключне_або(значення щось) щось ;; перезаписує оператор ^

чародія_порівняти_чи_рівно(значення щось) щось ;; перезаписує оператори == та "рівно"
чародія_порівняти_чи_менше(значення щось) щось ;; перезаписує оператори < та "менше"
чародія_порівняти_чи_не_менше(значення щось) щось ;; перезаписує оператори >= та "не менше"
чародія_порівняти_чи_більше(значення щось) щось ;; перезаписує оператори > та "більше"
чародія_порівняти_чи_не_більше(значення щось) щось ;; перезаписує оператори <= та "не більше"

чародія_отримати_спеціальну_властивість(назва текст) щось ;; виконується на отримання спеціальної властивості (а[б])
чародія_змінити_спеціальну_властивість(назва текст, значення щось) ніщо ;; виконується на зміну спеціальної властивості (а[б] = в)

чародія_перетворити_на_текст() текст ;; виконується для перетворення на текст
чародія_перетворити_на_число() число ;; виконується для перетворення на число
чародія_перетворити_на_логічне() логічне ;; виконується для перетворення на логічне

чародія_створити(...) ніщо ;; перезаписує створення обʼєкта
чародія_після_створення() ніщо ;; виконується після створення обʼєкта
`.trim();

const simple2 = `
структура МіфічнаІстота
  назва текст
кінець

дія МіфічнаІстота.чародія_викликати()
  друк("%(я.назва) вже на шляху до вас...")
кінець

лісовик = МіфічнаІстота("Лісовик")

лісовик()
`.trim();

useHead({
  title: "Чародія | Документація | Мавка",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/коментар" next="/документація/пак">
    <h1 class="docs-content-title">Чародія</h1>
    <p>
      <span class="diia-word">Мавка</span> надає можливість перезаписувати
      логіку деяких вказівок для обʼєктів через
      <span style="font-weight: 500" class="hljs-keyword">дії</span>. Ці
      <span style="font-weight: 500" class="hljs-keyword">дії</span>
      називаються чародіями.
    </p>
    <hr />
    <h3>Список чародій</h3>
    <UiCodeBlock :files="simple1" />
    <hr />
    <h3>Приклад</h3>
    <UiCodeBlock :files="simple2" />
    <hr />
    <blockquote>
      Щось ще може змінитись до версії 1.0.0. Прохання мати це наувазі.
    </blockquote>
  </UiDocsWrapper>
</template>
