<script setup>
const simple = `
;; взяти пак інтернет.отримати

чекати книги = отримати("пі.книги.укр/за_автором/Леся+Українка")

друк(книги)
`.trim();

const simple2 = `
;; взяти пак інтернет.передати

лісова_пісня = Книга(
  назва="Лісова пісня",
  автор=Автор("Леся Українка"),
  рік=1911
)

чекати передати("пі.книги.укр/зберегти", лісова_пісня)
`.trim();

const simple3 = `
;; взяти пак інтернет.приєднатись

кімната_книг = чекати приєднатись("кімната.книги.укр")

кімната_книг.слухати(
  (подія) -> друк(подія)
)

чекати кімната_книг.передати("привіт!")

чекати кімната_книг.вийти()
`.trim();

useHead({
  title: "Інтернет | Документація | Мавка",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/дід" next="/документація/математика">
    <h1 class="docs-content-title">Інтернет</h1>
    <blockquote>
      Офіційний модуль в процесі написання. Тимчасове рішення: використання
      <NuxtLink
        class="link external"
        :href="encodeURI('/документація/розширення')"
        >розширень</NuxtLink
      >.
    </blockquote>
  </UiDocsWrapper>
</template>
