<script setup>
const simple1 = `
виконати_виклик ;; перезаписує оператор виклику ()

виконати_додавання ;; перезаписує оператор +
виконати_віднімання ;; перезаписує оператор -
виконати_множення ;; перезаписує оператор -
виконати_ділення ;; перезаписує оператор /

виконати_ділення_за_модулем_остача ;; перезаписує оператор %
виконати_ділення_за_модулем_частка ;; перезаписує оператор //

виконати_піднесення_до_степеня ;; перезаписує оператор **

виконати_зсув_вліво ;; перезаписує оператор <<
виконати_зсув_вправо ;; перезаписує оператор >>
виконати_побітове_і ;; перезаписує оператор &
виконати_побітове_або ;; перезаписує оператор |
виконати_побітове_не ;; перезаписує оператор ~
виконати_виняткову_дизʼюнкцію ;; перезаписує оператор ^

виконати_порівняння_чи_рівно ;; перезаписує оператори == та "рівно"
виконати_порівняння_чи_не_рівно ;; перезаписує оператори !=, "не" та "не рівно"
виконати_порівняння_чи_менше ;; перезаписує оператори < та "менше"
виконати_порівняння_чи_не_менше ;; перезаписує оператори >= та "не менше"
виконати_порівняння_чи_більше ;; перезаписує оператори > та "більше"
виконати_порівняння_чи_не_більше ;; перезаписує оператори <= та "не більше"

виконати_отримання ;; викликається на отримання властивості, якої не існує
виконати_присвоєння ;; викликається на присвоєння властивості
виконати_видалення ;; викликається на видалення властивості

виконати_перетворення_на_текст ;; викликається для перетворення на текст
виконати_перетворення_на_число ;; викликається для перетворення на число
виконати_перетворення_на_логічне ;; викликається для перетворення на логічне

виконати_створення ;; викликається для створення обʼєкта зі структури
виконати_після_створення ;; викликається після створення обʼєкта зі структури
`.trim();

const simple2 = `
структура МіфічнаІстота
  назва текст
кінець

дія МіфічнаІстота.виконати_виклик()
  друк("%(я.назва) вже на шляху до вас...")
кінець

лісовик = МіфічнаІстота("Лісовик")

лісовик()
`.trim();

useHead({
  title: "Магічні дії | Документація | Мавка",
});
</script>

<template>
  <UiDocsWrapper prev="/docs/tries" next="/docs/lists">
    <h1 class="docs-content-title">Магічні дії</h1>

    <p>
      <span class="diia-word">Мавка</span> надає можливість перезаписувати деякі
      вбудовані операції для структур через дії. Ці дії називаються магічними.
    </p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs lang="diia" :autodetect="false" :code="simple1" />
      </ClientOnly>
    </div>
    <p>Приклад:</p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs lang="diia" :autodetect="false" :code="simple2" />
      </ClientOnly>
    </div>
  </UiDocsWrapper>
</template>
