<script setup>
const simple = `
структура Персона
  піб текст
  вік число
  зацікавлення список
кінець

розтин_персони = Розтин.виконати_розтин_структури(Персона)

друк(розтин_персони.назва)
друк(розтин_персони.властивості)
друк(розтин_персони.дії)
`.trim();

const definitions = `
макет МакетРозтинуДії
  назва текст
  параметри []МакетРозтинуПараметруДії
  результат Структура
кінець

макет МакетРозтинуПараметруДії
  назва текст
  тип Структура

  усталене_значення() щось або пусто
кінець

макет МакетРозтинуСтруктури
  назва текст
  властивості []МакетРозтинуВластивостіСтруктури
  дії []МакетРозтинуДіїСтруктури
кінець

макет МакетРозтинуВластивостіСтруктури
  назва текст
  тип Структура
кінець

макет МакетРозтинуДіїСтруктури є МакетРозтинуДії
  назва текст
  параметри []РозтинВластивостіСтруктури
  результат Структура
кінець

макет модуль МакетМодуляРозтину
  розтин_структури(с Структура) МакетРозтинуСтруктури
  розтин_властивості_структури(в Структура, назва текст) МакетРозтинуВластивостіСтруктури
  розтин_дії(д Дія) МакетРозтинуДії
  розтин_параметру_дії(д Дія, назва текст) МакетРозтинуПараметруДії
кінець
`.trim();
</script>

<template>
  <DocsWrapper prev="/docs" next="/docs/vars">
    <h1 class="docs-content-title">
      Розтини
    </h1>

    <p>
      Розтин є способом для отримання інформації про структуру, дію тощо.
    </p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs
            language="diia"
            :autodetect="false"
            :code="simple"
        />
      </ClientOnly>
    </div>
    <p>
      Структури розтину:
    </p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs
            language="diia"
            :autodetect="false"
            :code="definitions"
        />
      </ClientOnly>
    </div>
  </DocsWrapper>
</template>
