<script setup>
const simple = `
структура Персона
  піб текст
  вік число
  зацікавлення список
кінець

розбір_персони = розбір.розібрати_структуру(Персона)

друк(розбір_персони.назва)
друк(розбір_персони.властивості)
друк(розбір_персони.дії)
`.trim();

const definitions = `
макет МакетРозборуДії
  назва текст
  параметри []МакетРозборуПараметруДії
  результат Структура
кінець

макет МакетРозборуПараметруДії
  назва текст
  тип Структура
  усталене_значення() щось або пусто
кінець

макет МакетРозборуСтруктури
  назва текст
  властивості []МакетРозборуВластивостіСтруктури
  дії []МакетРозборуДіїСтруктури
кінець

макет МакетРозборуВластивостіСтруктури
  назва текст
  тип Структура
  усталене_значення() щось або пусто
кінець

макет МакетРозборуДіїСтруктури є МакетРозборуДії
  назва текст
  параметри []РозбірВластивостіСтруктури
  результат Структура
кінець

макет модуль макет_модуля_розбору
  розібрати_структуру(с Структура) МакетРозборуСтруктури
  розібрати_властивість_структури(c Структура, назва текст) МакетРозборуВластивостіСтруктури
  розібрати_дію(д Дія) МакетРозборуДії
  розібрати_параметр_дії(д Дія, назва текст) МакетРозборуПараметруДії
кінець
`.trim();

useHead({
  title: "Розбір | Документація | Мавка",
});
</script>

<template>
  <UiDocsWrapper prev="/docs/style" next="/docs/testing">
    <h1 class="docs-content-title">Розбір</h1>

    <p>Розбір є способом для отримання інформації про структуру, дію тощо.</p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs language="diia" :autodetect="false" :code="simple" />
      </ClientOnly>
    </div>
    <p>Макети розбору:</p>
    <div class="code-window code-window-full">
      <ClientOnly>
        <highlightjs language="diia" :autodetect="false" :code="definitions" />
      </ClientOnly>
    </div>
  </UiDocsWrapper>
</template>
