<script setup>
</script>

<template>
  <DocsWrapper prev="/docs/data" next="/docs/changelog">
    <h1 class="docs-content-title">
      Версія 1
    </h1>

    <p>
      Цей документ репрезентує список основних можливостей мови, що мають бути присутні у першій реліз-версії.
    </p>
    <ul>
      <li>змінні</li>
      <li>дії</li>
      <li>функції</li>
      <li>типи</li>
      <li>умовні операції</li>
      <li>цикли</li>
      <li>структури</li>
      <li>модулі</li>
      <li>паки</li>
      <li>тривалі операції</li>
      <li>спроби</li>
      <li>розширення</li>
      <li>коментарі</li>
      <li>сб: математика</li>
      <li>сб: інтернет</li>
      <li>сб: чз (читання запис)</li>
      <li>сб: списки</li>
      <li>сб: дід</li>
      <li>...</li>
      <li>можливість писати скрипти</li>
      <li>можливість написати повноцінний телеграм бот</li>
      <li>базова підтримка популярними IDE (VSCode / JetBrains)</li>
    </ul>
    <p>
      Мова повинна надавати достатньо інструментів для можливості роботи будь-якого перекладеного скрипта з python/js/ruby/shell.
    </p>
  </DocsWrapper>
</template>
