<template>
  <main class="container">
    <NavigationBar/>

    <div class="ui-pravo-page">
      <p>Право автора 2023 Давид Когут &lt;мавка.укр&gt;</p>

      <p>
        Дозвіл надається на вільне поширення, використання та модифікацію цього програмного
        забезпечення або його похідних за умови дотримання усіх умов цієї ліцензії.
      </p>
      <p>
        У випадку недотримання умов цієї ліцензії поширення, використання та модифікація цього
        програмного забезпечення або його похідних відбувається на ваш страх та ризик.
      </p>
      <p>
        Будь-які намагання паразитувати на цьому програмному забезпеченні або його похідних є
        неприпустимими і будуть покарані.
      </p>
      <p>
        Автор залишає за собою право обрати спосіб та рівень покарання, якщо такі не передбачені
        чинним законом України або якщо закон України визнано таким, що, де-факто, його дотримання не
        забезпечується або якщо визнано, що, де-факто, не забезпечується належний захист громадян України.
      </p>
      <p>
        Автор не несе відповідальності за наслідки використання цього програмного забезпечення або
        його похідних.
      </p>
      <p>Умови використання, поширення та модифікації:</p>
      <p>
        1. При будь-якому поширенні цього програмного забезпечення або його похідних є обовʼязковим збереження цього
        повідомлення про право автора.
      </p>
      <p>
        2. При будь-якій модифікації цього програмного забезпечення або його похідних є обовʼязковим
        збереження цього повідомлення про право автора.
      </p>
      <p>
        3. Забороняється у будь-якому способі модифікувати назву або логотип при поширенні або
        модифікації цього програмного забезпечення або його похідних.
      </p>
    </div>

    <SectionFooter/>
  </main>
</template>

<style lang="scss">
.ui-pravo-page {
  min-height: 65vh;
}
</style>
